app/views/blogposts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  <p><%= blogpost.title %></p>
  <p>Author: <%= "#{blogpost.user.first_name} #{blogpost.user.last_name}"  %></p>