app/controllers/blogposts_controller.rb

INSERT INTO "blogposts" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "FFFF"], ["user_id", 2], ["created_at", 2017-05-10 10:31:23 UTC], ["updated_at", 2017-05-10 10:31:23 UTC]]
---
  def create
    @user = current_user
    @blogpost = @user.blogposts.create(blogpost_params)