app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Super"], ["password_digest", "$2a$10$glfXzYh.NZkeqTZzvpBL9.HmbWgGIlpYzQLJaXLxo3mXjwIT7Cxym"], ["updated_at", 2017-05-10 08:47:51 UTC], ["id", 2]]